{
    "Chordate": {
        "Craniata": {
            "Myxini": "Hagfish, the class Myxini (also known as Hyperotreti), are eel-shaped, slime-producing marine fish (occasionally called slime eels). They are the only known living animals that have a skull but no vertebral column. Along with lampreys, hagfish are jawless; they are the sister group to vertebrates, and living hagfish remain similar to hagfish from around 300 million years ago. <br><br>(\"Hagfish.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation.)",
            "Vertebrata": {
                "Agnatha": "Agnatha (Greek,[4] \"no jaws\") is a superclass of jawless fish in the phylum Chordata, subphylum Vertebrata, consisting of both present (cyclostomes) and extinct (conodonts and ostracoderms) species. The group excludes all vertebrates with jaws, known as gnathostomes. <br><br>(\"Agnatha.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation.)",
                "Chondrichthyes": "Chondrichthyes is a class that contains the cartilaginous fishes: they are jawed vertebrates with paired fins, paired nares, scales, a heart with its chambers in series, and skeletons made of cartilage rather than bone. The class is divided into two subclasses: Elasmobranchii (sharks, rays, skates, and sawfish) and Holocephali (chimaeras, sometimes called ghost sharks, which are sometimes separated into their own class). <br><br>(\"Chondrichthyes.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation.)",
                "Osteichthyes": "Osteichthyes, popularly referred to as the bony fish, is a diverse taxonomic group of fish that have skeletons primarily composed of bone tissue, as opposed to cartilage. The vast majority of fish are members of Osteichthyes, which is an extremely diverse and abundant group consisting of 45 orders, and over 435 families and 28,000 species.[1] It is the largest class of vertebrates in existence today. The group Osteichthyes is divided into the ray-finned fish (Actinopterygii) and lobe-finned fish (Sarcopterygii). The oldest known fossils of bony fish are about 420 million years ago, which are also transitional fossils, showing a tooth pattern that is in between the tooth rows of sharks and bony fishes. <br><br>(\"Osteichthyes.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation, Inc. 22 July 2004. Web. 10 Aug. 2004).",
                "Amphibia": "Amphibians are ectothermic, tetrapod vertebrates of the class Amphibia. Modern amphibians are all Lissamphibia. They inhabit a wide variety of habitats, with most species living within terrestrial, fossorial, arboreal or freshwater aquatic ecosystems. Thus amphibians typically start out as larvae living in water, but some species have developed behavioural adaptations to bypass this. The young generally undergo metamorphosis from larva with gills to an adult air-breathing form with lungs. Amphibians use their skin as a secondary respiratory surface and some small terrestrial salamanders and frogs lack lungs and rely entirely on their skin. They are superficially similar to lizards but, along with mammals and birds, reptiles are amniotes and do not require water bodies in which to breed. With their complex reproductive needs and permeable skins, amphibians are often ecological indicators; in recent decades there has been a dramatic decline in amphibian populations for many species around the globe. <br><br>(\"Amphibian.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation, Inc. 22 July 2004. Web. 10 Aug. 2004)",
                "Reptilia": "Reptiles are tetrapod (four-limbed vertebrate) animals in the class Reptilia, comprising today's turtles, crocodilians, snakes, amphisbaenians, lizards, tuatara, and their extinct relatives. The study of these traditional reptile orders, historically combined with that of modern amphibians, is called herpetology. <br><br>(\"Reptile.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation, Inc. 22 July 2004. Web. 10 Aug. 2004)",
                "Aves": "Birds (Aves), also known as avian dinosaurs,[3] are a group of endothermic vertebrates, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a lightweight but strong skeleton. Birds live worldwide and range in size from the 5 cm (2 in) bee hummingbird to the 2.75 m (9 ft) ostrich. They rank as the class of tetrapods with the most living species, at approximately ten thousand, with more than half of these being passerines, sometimes known as perching birds or, less accurately, as songbirds. <br><br>(\"Aves.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation, Inc. 22 July 2004. Web. 10 Aug. 2004)",
                "Mammalia": {
                    "Monotreme": "Monotremes are basal mammals that lay eggs (Prototheria) instead of giving birth to live young like marsupials (Metatheria) and placental mammals (Eutheria). The only surviving examples of monotremes are all indigenous to Australia and New Guinea, although there is evidence that they were once more widespread. The existing monotreme species are the platypus and four species of echidnas. There is currently some debate regarding monotreme taxonomy. <br><br>(\"Monotreme.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation, Inc. 22 July 2004. Web. 10 Aug. 2004)",
                    "Theria": "Theria is a subclass of mammals[2] amongst the Theriiformes (the sister taxa to Yinotheria). Theria includes the eutherians (including the placental mammals) and the metatherians (including the marsupials). <br><br>(\"Theria.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation, Inc. 22 July 2004. Web. 10 Aug. 2004)"
                }
            }
        },
        "Cephalochordata": "A cephalochordate is an animal in the chordate subphylum, Cephalochordata. They are characterized as chordates, as they possess all 5 of the chordate characteristics during larval stages and through to adulthood. This includes: notocord, dorsal nerve cord, endostyle, pharynx and post-anal tail.[2] Cephalochordates are represented in the modern oceans by the Amphioxiformes (lancelets, also known as amphioxus). Along with its sister phylum, Urochordata, Cephalochordata can be classified as belonging to the taxon Protochordata <br><br>(\"Cephalochordate.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation.)"
    },
    "Ambulacraria": "Ambulacraria or Coelomopora is a clade of invertebrate phyla which includes echinoderms and hemichordates; a member of this group is called an ambulacrarian. The Ambulacraria are part of the Deuterostomes, a larger clade that also includes the Chordata and Vetulicolia. <br><br>(\"Ambulacraria.\" Wikipedia: The Free Encyclopedia. Wikimedia Foundation.)"
}
